app/Models/TareaAlumnoModel.php

    public function getTareasByAlumno($alumno_id)
    {
        return $this->select('tareas.*, tareas_alumnos.estado as estado_asignacion, tareas_alumnos.calificacion, tareas_alumnos.comentario_calificacion, tareas_alumnos.fecha_calificacion')
                   ->join('tareas', 'tareas.id = tareas_alumnos.tarea_id')
                   ->where('tareas_alumnos.alumno_id', $alumno_id)
                   ->findAll();
---
SELECT `tareas`.*, `tareas_alumnos`.`estado` as `estado_asignacion`, `tareas_alumnos`.`calificacion`, `tareas_alumnos`.`comentario_calificacion`, `tareas_alumnos`.`fecha_calificacion`
FROM `tareas_alumnos`
JOIN `tareas` ON `tareas`.`id` = `tareas_alumnos`.`tarea_id`
WHERE `tareas_alumnos`.`alumno_id` = '4'